package pers.cjw.regexAPI;

public class RegexDemo5 {
    public static void main(String[] args) {

        //需求：
        //验证手机号码 13112345678 13712345667 13945679027 139456790271
        //验证座机电话号码 020-2324242 02122442 027-42424 0712-3242434
        //验证邮箱号码 3232323@qq.com zhangsan@itcast.cnn dlei0009@163.com dlei0009@pci.com.cn

        //==============================================================================================================

        //手机号码：共11位
        //1：只能以1开头
        //[3-9]：第2位只能是3-9，不能是1和2
        //\\d{9} 后面任意数字只能出现9次
        String regex1 = "1[3-9]\\d{9}";
        System.out.println("13112345678".matches(regex1));//true
        System.out.println("13712345667".matches(regex1));//true
        System.out.println("13945679027".matches(regex1));//true
        System.out.println("139456790271".matches(regex1));//false，
        System.out.println("-----------------------------------");

        //==============================================================================================================

        //座机号码:区号+号码
        //020-2324242 02122442 027-42424 0712-3242434

        //（1）区号：可以是3位可以是4位
        //0:区号开头为0
        //\\d{2,3}:表示第一位后面的2次到3次，可以是任意数字
        //-?：-出现0次或1次（有杠或无杠）

        //（2）号码
        //[1-9]：号码的第一位为1-9，不能为0
        //\\d{4,9}：号码的总长度:5-10位，从第2位开始可以是任意的数字，所以[0-9]可以重复4-9次.
        String regex2 = "0\\d{2,3}-?[1-9]\\d{4,9}";
        System.out.println("020-2324242".matches(regex2));
        System.out.println("02122442".matches(regex2));
        System.out.println("027-42424".matches(regex2));
        System.out.println("0712-3242434".matches(regex2));
        System.out.println("-----------------------------------");

        //==============================================================================================================

        //邮箱：三部分
        //3232323@qq.com zhangsan@itcast.cnn dlei0009@163.com dlei0009@pci.com.cn

        //（1）@的左边
        //\\w+：\\w代表任意的字母数字下划线，+代表至少出现一次

        //（2）@：只能出现一次

        //（3）@的右边
        //[\\w&&[^_]]{2,6}：任意的单词字符，但不能是下划线，总共出现2-6次，一般比如 qq 或者 163 或者 google 就是这部分
        //(\.[a-zA-Z]{2,3})：一个.加上2-3位的字母。后面的{1,2}代表“.xxx"格式出现1-2次，因为存在二级域名，比如.co.uk
        String regex3 = "\\w+@[\\w&&[^_]]{2,6}(\\.[a-zA-Z]{2,3}){1,2}";
        System.out.println("3232323@qq.com".matches(regex3));
        System.out.println("zhangsan@itcast.cnn".matches(regex3));
        System.out.println("dlei0009@163.com".matches(regex3));
        System.out.println("dlei0009@pci.com.cn".matches(regex3));
        System.out.println("-----------------------------------");

        //==============================================================================================================

        //24小时的正则表达式：
        //小时部分：([01]\d|2[0-3])：[01]\d 或者 2[0-3]：00-09点，10-19点，20-23点
        //分钟部分：[0-5]\d，第一位0-5，后面一位随意。
        //秒数部分：[0-5]\d，第一位0-5，后面一位随意。
        String regex4 = "([01]\\d|2[0-3]):[0-5]\\d:[0-5]\\d";
        System.out.println("23:11:11".matches(regex4));//true

        //优化：分钟部分和秒数部分格式相同，所以可以合起来写{2}次。
        String regex5 = "([01]\\d|2[0-3])(:[0-5]\\d){2}";
        System.out.println("23:11:11".matches(regex5));//true
    }
}
