package pers.cjw.regexAPI;

public class RegexDemo6 {
    public static void main(String[] args) {

        //1.验证用户名是否满足要求。
        //要求:大小写字母，数字，下划线一共4-16位

        //2.验证身份证号码是否满足要求。
        //简单要求：18位，前17位任意数字。最后一位可以是数字，也可以可以是大写或小写的x
        //复杂要求:按照身份证号码的格式严格要求。前六位地区，中间生日，最后4位有格式

        //身份证号码:
        //41080119930228457x
        //510801197609022309
        //15040119810705387X
        //130133197204039024 I
        //430102197606046442

        //==============================================================================================================

        //1.用户名要求:大小写字母，数字，下划线一共4-16位
        String regex1 = "\\w{4,16}";
        System.out.println("zhangsan".matches(regex1));
        System.out.println("lisi".matches(regex1));
        System.out.println("wangwu".matches(regex1));
        System.out.println("$123".matches(regex1));
        System.out.println("------------------------------");

        //==============================================================================================================

        //身份证号码简单校验：
        //18位，前17位任意数字，最后一位可以是数字可以是大写或小写的x
        //（1）[1-9]：第一位不为0，为1-9
        //（2）\\d{16}：任意数字出现16次
        //（3）[\\dXx]：要么是任意d数字，要么是大写X，要么是小写x

        String regex2 = "[1-9]\\d{16}[\\dXx]";
        System.out.println("41080119930228457x".matches(regex2));
        System.out.println("510801197609022309".matches(regex2));
        System.out.println("15040119810705387X".matches(regex2));
        System.out.println("130133197204039024".matches(regex2));
        System.out.println("430102197606046442".matches(regex2));
        System.out.println("------------------------------");

        //忽略大小写的书写方式
        //(?i)b：在匹配的时候忽略b的大小写
        String regex4 = "a((?i)b)c";
        System.out.println("abc".matches(regex4));//true
        System.out.println("aBc".matches(regex4));//true
        System.out.println("------------------------------");

        //所以身份证的简单验证也可以这么写：
        String regex5 = "[1-9]\\d{16}(\\d(?i)x)";

        //==============================================================================================================

        //身份证号码的严格校验
        //[1-9]\\d{5}：前面6位为省份，市区，派出所等信息，第一位不能是0，后面5位是任意数字
        //(18|19|20)：出生年份的前半段，一般为18 19 20
        //\\d{2}：出生年份的后半段: 2个任意数字
        //(0[1-9]|1[0-2])：出生月份: 01-09 或 10-12
        //(0[1-9]|[12]\\d|3[01])：出生日期: 01~09 10~19 20~29 30 31
        //\\d{3}[\\dXx]：最后四位: 任意数字出现3次，最后一位可以是数字也可以是大写x或者小写x
        String regex6 = "[1-9]\\d{5}(18|19|20)\\d{2}(@[1-9]|1[0-2])(@[1-9]|[12]\\d|3[01])\\d{3}[\\dxXx]";

        System.out.println("41080119930228457x".matches(regex6));
        System.out.println("510801197609022309".matches(regex6));
        System.out.println("15040119810705387X".matches(regex6));
        System.out.println("130133197204039024".matches(regex6));
        System.out.println("430102197606046442".matches(regex6));
        System.out.println("------------------------------");

    }
}
